MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA410/mcu.h
extern volatile IOCPDBBITS IOCPDBbits __attribute__((__sfr__));

#define TRISC TRISC
extern volatile uint16_t TRISC __attribute__((__sfr__));
typedef struct tagTRISCBITS {
  uint16_t :1;
  uint16_t TRISC1:1;
  uint16_t TRISC2:1;
  uint16_t TRISC3:1;
  uint16_t TRISC4:1;
  uint16_t :7;
  uint16_t TRISC12:1;
  uint16_t TRISC13:1;
  uint16_t TRISC14:1;
  uint16_t TRISC15:1;
} TRISCBITS;
extern volatile TRISCBITS TRISCbits __attribute__((__sfr__));

#define PORTC PORTC
extern volatile uint16_t PORTC __attribute__((__sfr__));
typedef struct tagPORTCBITS {
  uint16_t :1;
  uint16_t RC1:1;
  uint16_t RC2:1;
  uint16_t RC3:1;
  uint16_t RC4:1;
  uint16_t :7;
  uint16_t RC12:1;
  uint16_t RC13:1;
  uint16_t RC14:1;
  uint16_t RC15:1;
} PORTCBITS;
extern volatile PORTCBITS PORTCbits __attribute__((__sfr__));

#define LATC LATC
extern volatile uint16_t LATC __attribute__((__sfr__));
typedef struct tagLATCBITS {
  uint16_t :1;
  uint16_t LATC1:1;
  uint16_t LATC2:1;
  uint16_t LATC3:1;
  uint16_t LATC4:1;
  uint16_t :7;
  uint16_t LATC12:1;
  uint16_t :2;
  uint16_t LATC15:1;
} LATCBITS;
extern volatile LATCBITS LATCbits __attribute__((__sfr__));

#define ODCC ODCC
extern volatile uint16_t ODCC __attribute__((__sfr__));
typedef struct tagODCCBITS {
  uint16_t :1;
  uint16_t ODCC1:1;
  uint16_t ODCC2:1;
  uint16_t ODCC3:1;
  uint16_t ODCC4:1;
  uint16_t :7;
  uint16_t ODCC12:1;
  uint16_t :2;
  uint16_t ODCC15:1;
} ODCCBITS;
extern volatile ODCCBITS ODCCbits __attribute__((__sfr__));

#define ANSC ANSC
extern volatile uint16_t ANSC __attribute__((__sfr__));
__extension__ typedef struct tagANSCBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t ANSC1:1;
      uint16_t ANSC2:1;
      uint16_t ANSC3:1;
      uint16_t ANSC4:1;
    };
    struct {
      uint16_t :1;
      uint16_t ANSELC1:1;
      uint16_t ANSELC2:1;
      uint16_t ANSELC3:1;
      uint16_t ANSELC4:1;
    };
  };
} ANSCBITS;
extern volatile ANSCBITS ANSCbits __attribute__((__sfr__));

#define ANSELC ANSELC
extern volatile uint16_t ANSELC __attribute__((__sfr__));
__extension__ typedef struct tagANSELCBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t ANSC1:1;
      uint16_t ANSC2:1;
      uint16_t ANSC3:1;
      uint16_t ANSC4:1;
    };
    struct {
      uint16_t :1;
      uint16_t ANSELC1:1;
      uint16_t ANSELC2:1;
      uint16_t ANSELC3:1;
      uint16_t ANSELC4:1;
    };
  };
} ANSELCBITS;
extern volatile ANSELCBITS ANSELCbits __attribute__((__sfr__));

#define IOCPC IOCPC
extern volatile uint16_t IOCPC __attribute__((__sfr__));
typedef struct tagIOCPCBITS {
  uint16_t :1;
  uint16_t IOCPC1:1;
  uint16_t IOCPC2:1;
  uint16_t IOCPC3:1;
  uint16_t IOCPC4:1;
  uint16_t :7;
  uint16_t IOCPC12:1;
  uint16_t IOCPC13:1;
  uint16_t IOCPC14:1;
  uint16_t IOCPC15:1;
} IOCPCBITS;
extern volatile IOCPCBITS IOCPCbits __attribute__((__sfr__));

#define IOCNC IOCNC
extern volatile uint16_t IOCNC __attribute__((__sfr__));
typedef struct tagIOCNCBITS {
  uint16_t :1;
  uint16_t IOCNC1:1;
  uint16_t IOCNC2:1;
  uint16_t IOCNC3:1;
  uint16_t IOCNC4:1;
  uint16_t :7;
  uint16_t IOCNC12:1;
  uint16_t IOCNC13:1;
  uint16_t IOCNC14:1;
  uint16_t IOCNC15:1;
} IOCNCBITS;
extern volatile IOCNCBITS IOCNCbits __attribute__((__sfr__));

#define IOCFC IOCFC
extern volatile uint16_t IOCFC __attribute__((__sfr__));
typedef struct tagIOCFCBITS {
  uint16_t :1;
  uint16_t IOCFC1:1;
  uint16_t IOCFC2:1;
  uint16_t IOCFC3:1;
  uint16_t IOCFC4:1;
  uint16_t :7;
  uint16_t IOCFC12:1;
  uint16_t IOCFC13:1;
  uint16_t IOCFC14:1;
  uint16_t IOCFC15:1;
} IOCFCBITS;
extern volatile IOCFCBITS IOCFCbits __attribute__((__sfr__));

#define CNPUC CNPUC
extern volatile uint16_t CNPUC __attribute__((__sfr__));
__extension__ typedef struct tagCNPUCBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t IOCPC1:1;
      uint16_t IOCPC2:1;
      uint16_t IOCPC3:1;
      uint16_t IOCPC4:1;
      uint16_t :7;
      uint16_t IOCPC12:1;
      uint16_t :2;
      uint16_t IOCPC15:1;
    };
    struct {
      uint16_t :1;
      uint16_t IOCPUC1:1;
      uint16_t IOCPUC2:1;
      uint16_t IOCPUC3:1;
      uint16_t IOCPUC4:1;
      uint16_t :7;
      uint16_t IOCPUC12:1;
      uint16_t :2;
      uint16_t IOCPUC15:1;
    };
    struct {
      uint16_t :1;
      uint16_t CNPUC1:1;
      uint16_t CNPUC2:1;
      uint16_t CNPUC3:1;
      uint16_t CNPUC4:1;
      uint16_t :7;
      uint16_t CNPUC12:1;
      uint16_t :2;
      uint16_t CNPUC15:1;
    };
  };
} CNPUCBITS;
extern volatile CNPUCBITS CNPUCbits __attribute__((__sfr__));

#define IOCPUC IOCPUC
extern volatile uint16_t IOCPUC __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUCBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t IOCPC1:1;
      uint16_t IOCPC2:1;
      uint16_t IOCPC3:1;
      uint16_t IOCPC4:1;
      uint16_t :7;
      uint16_t IOCPC12:1;
      uint16_t :2;
      uint16_t IOCPC15:1;
    };
    struct {
      uint16_t :1;
      uint16_t IOCPUC1:1;
      uint16_t IOCPUC2:1;
      uint16_t IOCPUC3:1;
      uint16_t IOCPUC4:1;
      uint16_t :7;
      uint16_t IOCPUC12:1;
      uint16_t :2;
      uint16_t IOCPUC15:1;
    };
    struct {
      uint16_t :1;
      uint16_t CNPUC1:1;
      uint16_t CNPUC2:1;
      uint16_t CNPUC3:1;
      uint16_t CNPUC4:1;
      uint16_t :7;
      uint16_t CNPUC12:1;
      uint16_t :2;
      uint16_t CNPUC15:1;
    };
  };
} IOCPUCBITS;
extern volatile IOCPUCBITS IOCPUCbits __attribute__((__sfr__));

#define CNPDC CNPDC
extern volatile uint16_t CNPDC __attribute__((__sfr__));
__extension__ typedef struct tagCNPDCBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t IOCPDC1:1;
      uint16_t IOCPDC2:1;
      uint16_t IOCPDC3:1;
      uint16_t IOCPDC4:1;
      uint16_t :7;
      uint16_t IOCPDC12:1;
      uint16_t :2;
      uint16_t IOCPDC15:1;
    };
    struct {
      uint16_t :1;
      uint16_t CNPDC1:1;
      uint16_t CNPDC2:1;
      uint16_t CNPDC3:1;
      uint16_t CNPDC4:1;
      uint16_t :7;
      uint16_t CNPDC12:1;
      uint16_t :2;
      uint16_t CNPDC15:1;
    };
  };
} CNPDCBITS;
extern volatile CNPDCBITS CNPDCbits __attribute__((__sfr__));

#define IOCPDC IOCPDC
extern volatile uint16_t IOCPDC __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDCBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t IOCPDC1:1;
      uint16_t IOCPDC2:1;
      uint16_t IOCPDC3:1;
      uint16_t IOCPDC4:1;
      uint16_t :7;
      uint16_t IOCPDC12:1;
      uint16_t :2;
      uint16_t IOCPDC15:1;
    };
    struct {
      uint16_t :1;
      uint16_t CNPDC1:1;
      uint16_t CNPDC2:1;
      uint16_t CNPDC3:1;
      uint16_t CNPDC4:1;
      uint16_t :7;
      uint16_t CNPDC12:1;
      uint16_t :2;
      uint16_t CNPDC15:1;
    };
  };
} IOCPDCBITS;
extern volatile IOCPDCBITS IOCPDCbits __attribute__((__sfr__));

