MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA410/mcu.h
#define _IPC22_U4RXIP0_POSITION                  0x00000000
#define _IPC22_U4RXIP0_MASK                      0x00000001
#define _IPC22_U4RXIP0_LENGTH                    0x00000001

#define _IPC22_U4RXIP1_POSITION                  0x00000001
#define _IPC22_U4RXIP1_MASK                      0x00000002
#define _IPC22_U4RXIP1_LENGTH                    0x00000001

#define _IPC22_U4RXIP2_POSITION                  0x00000002
#define _IPC22_U4RXIP2_MASK                      0x00000004
#define _IPC22_U4RXIP2_LENGTH                    0x00000001

#define _IPC22_U4TXIP0_POSITION                  0x00000004
#define _IPC22_U4TXIP0_MASK                      0x00000010
#define _IPC22_U4TXIP0_LENGTH                    0x00000001

#define _IPC22_U4TXIP1_POSITION                  0x00000005
#define _IPC22_U4TXIP1_MASK                      0x00000020
#define _IPC22_U4TXIP1_LENGTH                    0x00000001

#define _IPC22_U4TXIP2_POSITION                  0x00000006
#define _IPC22_U4TXIP2_MASK                      0x00000040
#define _IPC22_U4TXIP2_LENGTH                    0x00000001

#define _IPC22_SPI3IP0_POSITION                  0x00000008
#define _IPC22_SPI3IP0_MASK                      0x00000100
#define _IPC22_SPI3IP0_LENGTH                    0x00000001

#define _IPC22_SPI3IP1_POSITION                  0x00000009
#define _IPC22_SPI3IP1_MASK                      0x00000200
#define _IPC22_SPI3IP1_LENGTH                    0x00000001

#define _IPC22_SPI3IP2_POSITION                  0x0000000A
#define _IPC22_SPI3IP2_MASK                      0x00000400
#define _IPC22_SPI3IP2_LENGTH                    0x00000001

#define _IPC22_SPI3TXIP0_POSITION                0x0000000C
#define _IPC22_SPI3TXIP0_MASK                    0x00001000
#define _IPC22_SPI3TXIP0_LENGTH                  0x00000001

#define _IPC22_SPI3TXIP1_POSITION                0x0000000D
#define _IPC22_SPI3TXIP1_MASK                    0x00002000
#define _IPC22_SPI3TXIP1_LENGTH                  0x00000001

#define _IPC22_SPI3TXIP2_POSITION                0x0000000E
#define _IPC22_SPI3TXIP2_MASK                    0x00004000
#define _IPC22_SPI3TXIP2_LENGTH                  0x00000001

#define _IPC23_SPI4IP_POSITION                   0x00000000
#define _IPC23_SPI4IP_MASK                       0x00000007
#define _IPC23_SPI4IP_LENGTH                     0x00000003

#define _IPC23_SPI4TXIP_POSITION                 0x00000004
#define _IPC23_SPI4TXIP_MASK                     0x00000070
#define _IPC23_SPI4TXIP_LENGTH                   0x00000003

#define _IPC23_CCP3IP_POSITION                   0x00000008
#define _IPC23_CCP3IP_MASK                       0x00000700
#define _IPC23_CCP3IP_LENGTH                     0x00000003

#define _IPC23_CCP4IP_POSITION                   0x0000000C
#define _IPC23_CCP4IP_MASK                       0x00007000
#define _IPC23_CCP4IP_LENGTH                     0x00000003

#define _IPC23_SPI4IP0_POSITION                  0x00000000
#define _IPC23_SPI4IP0_MASK                      0x00000001
#define _IPC23_SPI4IP0_LENGTH                    0x00000001

#define _IPC23_SPI4IP1_POSITION                  0x00000001
#define _IPC23_SPI4IP1_MASK                      0x00000002
#define _IPC23_SPI4IP1_LENGTH                    0x00000001

#define _IPC23_SPI4IP2_POSITION                  0x00000002
#define _IPC23_SPI4IP2_MASK                      0x00000004
#define _IPC23_SPI4IP2_LENGTH                    0x00000001

#define _IPC23_SPI4TXIP0_POSITION                0x00000004
#define _IPC23_SPI4TXIP0_MASK                    0x00000010
#define _IPC23_SPI4TXIP0_LENGTH                  0x00000001

#define _IPC23_SPI4TXIP1_POSITION                0x00000005
#define _IPC23_SPI4TXIP1_MASK                    0x00000020
#define _IPC23_SPI4TXIP1_LENGTH                  0x00000001

#define _IPC23_SPI4TXIP2_POSITION                0x00000006
#define _IPC23_SPI4TXIP2_MASK                    0x00000040
#define _IPC23_SPI4TXIP2_LENGTH                  0x00000001

#define _IPC23_CCP3IP0_POSITION                  0x00000008
#define _IPC23_CCP3IP0_MASK                      0x00000100
#define _IPC23_CCP3IP0_LENGTH                    0x00000001

#define _IPC23_CCP3IP1_POSITION                  0x00000009
#define _IPC23_CCP3IP1_MASK                      0x00000200
#define _IPC23_CCP3IP1_LENGTH                    0x00000001

#define _IPC23_CCP3IP2_POSITION                  0x0000000A
#define _IPC23_CCP3IP2_MASK                      0x00000400
#define _IPC23_CCP3IP2_LENGTH                    0x00000001

#define _IPC23_CCP4IP0_POSITION                  0x0000000C
#define _IPC23_CCP4IP0_MASK                      0x00001000
#define _IPC23_CCP4IP0_LENGTH                    0x00000001

#define _IPC23_CCP4IP1_POSITION                  0x0000000D
#define _IPC23_CCP4IP1_MASK                      0x00002000
#define _IPC23_CCP4IP1_LENGTH                    0x00000001

#define _IPC23_CCP4IP2_POSITION                  0x0000000E
#define _IPC23_CCP4IP2_MASK                      0x00004000
#define _IPC23_CCP4IP2_LENGTH                    0x00000001

#define _IPC24_CLC1IP_POSITION                   0x00000000
#define _IPC24_CLC1IP_MASK                       0x00000007
#define _IPC24_CLC1IP_LENGTH                     0x00000003

#define _IPC24_CLC2IP_POSITION                   0x00000004
#define _IPC24_CLC2IP_MASK                       0x00000070
#define _IPC24_CLC2IP_LENGTH                     0x00000003

#define _IPC24_CLC3IP_POSITION                   0x00000008
#define _IPC24_CLC3IP_MASK                       0x00000700
#define _IPC24_CLC3IP_LENGTH                     0x00000003

#define _IPC24_CLC4IP_POSITION                   0x0000000C
#define _IPC24_CLC4IP_MASK                       0x00007000
#define _IPC24_CLC4IP_LENGTH                     0x00000003

#define _IPC24_CLC1IP0_POSITION                  0x00000000
#define _IPC24_CLC1IP0_MASK                      0x00000001
#define _IPC24_CLC1IP0_LENGTH                    0x00000001

#define _IPC24_CLC1IP1_POSITION                  0x00000001
#define _IPC24_CLC1IP1_MASK                      0x00000002
#define _IPC24_CLC1IP1_LENGTH                    0x00000001

#define _IPC24_CLC1IP2_POSITION                  0x00000002
#define _IPC24_CLC1IP2_MASK                      0x00000004
#define _IPC24_CLC1IP2_LENGTH                    0x00000001

