MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA410/mcu.h
#define _IOCPUH_IOCPH6_POSITION                  0x00000006
#define _IOCPUH_IOCPH6_MASK                      0x00000040
#define _IOCPUH_IOCPH6_LENGTH                    0x00000001

#define _IOCPUH_IOCPH7_POSITION                  0x00000007
#define _IOCPUH_IOCPH7_MASK                      0x00000080
#define _IOCPUH_IOCPH7_LENGTH                    0x00000001

#define _IOCPUH_IOCPH8_POSITION                  0x00000008
#define _IOCPUH_IOCPH8_MASK                      0x00000100
#define _IOCPUH_IOCPH8_LENGTH                    0x00000001

#define _IOCPUH_IOCPH9_POSITION                  0x00000009
#define _IOCPUH_IOCPH9_MASK                      0x00000200
#define _IOCPUH_IOCPH9_LENGTH                    0x00000001

#define _IOCPUH_IOCPH10_POSITION                 0x0000000A
#define _IOCPUH_IOCPH10_MASK                     0x00000400
#define _IOCPUH_IOCPH10_LENGTH                   0x00000001

#define _IOCPUH_IOCPH11_POSITION                 0x0000000B
#define _IOCPUH_IOCPH11_MASK                     0x00000800
#define _IOCPUH_IOCPH11_LENGTH                   0x00000001

#define _IOCPUH_IOCPH12_POSITION                 0x0000000C
#define _IOCPUH_IOCPH12_MASK                     0x00001000
#define _IOCPUH_IOCPH12_LENGTH                   0x00000001

#define _IOCPUH_IOCPH13_POSITION                 0x0000000D
#define _IOCPUH_IOCPH13_MASK                     0x00002000
#define _IOCPUH_IOCPH13_LENGTH                   0x00000001

#define _IOCPUH_IOCPH14_POSITION                 0x0000000E
#define _IOCPUH_IOCPH14_MASK                     0x00004000
#define _IOCPUH_IOCPH14_LENGTH                   0x00000001

#define _IOCPUH_IOCPH15_POSITION                 0x0000000F
#define _IOCPUH_IOCPH15_MASK                     0x00008000
#define _IOCPUH_IOCPH15_LENGTH                   0x00000001

#define _IOCPUH_IOCPUH0_POSITION                 0x00000000
#define _IOCPUH_IOCPUH0_MASK                     0x00000001
#define _IOCPUH_IOCPUH0_LENGTH                   0x00000001

#define _IOCPUH_IOCPUH1_POSITION                 0x00000001
#define _IOCPUH_IOCPUH1_MASK                     0x00000002
#define _IOCPUH_IOCPUH1_LENGTH                   0x00000001

#define _IOCPUH_IOCPUH2_POSITION                 0x00000002
#define _IOCPUH_IOCPUH2_MASK                     0x00000004
#define _IOCPUH_IOCPUH2_LENGTH                   0x00000001

#define _IOCPUH_IOCPUH3_POSITION                 0x00000003
#define _IOCPUH_IOCPUH3_MASK                     0x00000008
#define _IOCPUH_IOCPUH3_LENGTH                   0x00000001

#define _IOCPUH_IOCPUH4_POSITION                 0x00000004
#define _IOCPUH_IOCPUH4_MASK                     0x00000010
#define _IOCPUH_IOCPUH4_LENGTH                   0x00000001

#define _IOCPUH_IOCPUH5_POSITION                 0x00000005
#define _IOCPUH_IOCPUH5_MASK                     0x00000020
#define _IOCPUH_IOCPUH5_LENGTH                   0x00000001

#define _IOCPUH_IOCPUH6_POSITION                 0x00000006
#define _IOCPUH_IOCPUH6_MASK                     0x00000040
#define _IOCPUH_IOCPUH6_LENGTH                   0x00000001

#define _IOCPUH_IOCPUH7_POSITION                 0x00000007
#define _IOCPUH_IOCPUH7_MASK                     0x00000080
#define _IOCPUH_IOCPUH7_LENGTH                   0x00000001

#define _IOCPUH_IOCPUH8_POSITION                 0x00000008
#define _IOCPUH_IOCPUH8_MASK                     0x00000100
#define _IOCPUH_IOCPUH8_LENGTH                   0x00000001

#define _IOCPUH_IOCPUH9_POSITION                 0x00000009
#define _IOCPUH_IOCPUH9_MASK                     0x00000200
#define _IOCPUH_IOCPUH9_LENGTH                   0x00000001

#define _IOCPUH_IOCPUH10_POSITION                0x0000000A
#define _IOCPUH_IOCPUH10_MASK                    0x00000400
#define _IOCPUH_IOCPUH10_LENGTH                  0x00000001

#define _IOCPUH_IOCPUH11_POSITION                0x0000000B
#define _IOCPUH_IOCPUH11_MASK                    0x00000800
#define _IOCPUH_IOCPUH11_LENGTH                  0x00000001

#define _IOCPUH_IOCPUH12_POSITION                0x0000000C
#define _IOCPUH_IOCPUH12_MASK                    0x00001000
#define _IOCPUH_IOCPUH12_LENGTH                  0x00000001

#define _IOCPUH_IOCPUH13_POSITION                0x0000000D
#define _IOCPUH_IOCPUH13_MASK                    0x00002000
#define _IOCPUH_IOCPUH13_LENGTH                  0x00000001

#define _IOCPUH_IOCPUH14_POSITION                0x0000000E
#define _IOCPUH_IOCPUH14_MASK                    0x00004000
#define _IOCPUH_IOCPUH14_LENGTH                  0x00000001

#define _IOCPUH_IOCPUH15_POSITION                0x0000000F
#define _IOCPUH_IOCPUH15_MASK                    0x00008000
#define _IOCPUH_IOCPUH15_LENGTH                  0x00000001

#define _IOCPUH_CNPUH0_POSITION                  0x00000000
#define _IOCPUH_CNPUH0_MASK                      0x00000001
#define _IOCPUH_CNPUH0_LENGTH                    0x00000001

#define _IOCPUH_CNPUH1_POSITION                  0x00000001
#define _IOCPUH_CNPUH1_MASK                      0x00000002
#define _IOCPUH_CNPUH1_LENGTH                    0x00000001

#define _IOCPUH_CNPUH2_POSITION                  0x00000002
#define _IOCPUH_CNPUH2_MASK                      0x00000004
#define _IOCPUH_CNPUH2_LENGTH                    0x00000001

#define _IOCPUH_CNPUH3_POSITION                  0x00000003
#define _IOCPUH_CNPUH3_MASK                      0x00000008
#define _IOCPUH_CNPUH3_LENGTH                    0x00000001

#define _IOCPUH_CNPUH4_POSITION                  0x00000004
#define _IOCPUH_CNPUH4_MASK                      0x00000010
#define _IOCPUH_CNPUH4_LENGTH                    0x00000001

#define _IOCPUH_CNPUH5_POSITION                  0x00000005
#define _IOCPUH_CNPUH5_MASK                      0x00000020
#define _IOCPUH_CNPUH5_LENGTH                    0x00000001

#define _IOCPUH_CNPUH6_POSITION                  0x00000006
#define _IOCPUH_CNPUH6_MASK                      0x00000040
#define _IOCPUH_CNPUH6_LENGTH                    0x00000001

#define _IOCPUH_CNPUH7_POSITION                  0x00000007
#define _IOCPUH_CNPUH7_MASK                      0x00000080
#define _IOCPUH_CNPUH7_LENGTH                    0x00000001

#define _IOCPUH_CNPUH8_POSITION                  0x00000008
#define _IOCPUH_CNPUH8_MASK                      0x00000100
#define _IOCPUH_CNPUH8_LENGTH                    0x00000001

#define _IOCPUH_CNPUH9_POSITION                  0x00000009
#define _IOCPUH_CNPUH9_MASK                      0x00000200
#define _IOCPUH_CNPUH9_LENGTH                    0x00000001

#define _IOCPUH_CNPUH10_POSITION                 0x0000000A
#define _IOCPUH_CNPUH10_MASK                     0x00000400
#define _IOCPUH_CNPUH10_LENGTH                   0x00000001

#define _IOCPUH_CNPUH11_POSITION                 0x0000000B
#define _IOCPUH_CNPUH11_MASK                     0x00000800
#define _IOCPUH_CNPUH11_LENGTH                   0x00000001

