MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA410/mcu.h
/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Brown-out Reset Enable bits:
**     BOREN_OFF            Brown-out Reset Disabled
**     BOREN_ON             Brown-out Reset Enable
**
**   Low power regulator control:
**     LPCFG_ON             Enabled
**     LPCFG_OFF            Disabled
**
*/

#define BOREN_OFF            0x0004
#define BOREN_ON             0x0005

#define LPCFG_ON             0x0001
#define LPCFG_OFF            0x0005

/* Register FICD (0xafa8)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0xafa8),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Emulator Pin Placement Select bits:
**     ICS_PGx3             Emulator functions are shared with PGEC3/PGED3
**     ICS_PGx2             Emulator functions are shared with PGEC2/PGED2
**     ICS_PGx1             Emulator functions are shared with PGEC1/PGED1
**
**   JTAG Port Enable:
**     JTAGEN_OFF           JTAG port is disabled
**     JTAGEN_ON            JTAG port is enabled
**
**   BOOTSWP Instruction Enable bit:
**     BTSWP_ON             BOOTSWP instruction is enabled
**     BTSWP_OFF            BOOTSWP instruction is disabled
**
*/

#define ICS_PGx3             0x80A1
#define ICS_PGx2             0x80A2
#define ICS_PGx1             0x80A3

#define JTAGEN_OFF           0x8083
#define JTAGEN_ON            0x80A3

#define BTSWP_ON             0x00A3
#define BTSWP_OFF            0x80A3

/* Register FDS (0xafac)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDS;
#define _FDS(x) __attribute__((address(0xafac),deprecated_definition("consider migrating to #pragma config"),section("__FDS.sec"),space(prog))) __prog__ uint16_t _FDS = (x);

/*
** Only one invocation of FDS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDS.
** Multiple options may be combined, as shown:
**
** _FDS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Deep Sleep Watchdog Timer Postscale Select bits:
**     DSWDTPS_DSWDTPS00    1:32 (1 ms)
**     DSWDTPS_DSWDTPS01    1:64 (2.1 ms)
**     DSWDTPS_DSWDTPS02    1:128 (4.1 ms)
**     DSWDTPS_DSWDTPS03    1:256 (8.3 ms)
**     DSWDTPS_DSWDTPS04    1:512 (16.5 ms)
**     DSWDTPS_DSWDTPS05    1:1,024 (33 ms)
**     DSWDTPS_DSWDTPS06    1:2,048 (66.1 ms)
**     DSWDTPS_DSWDTPS07    1:4,096 (132.1 ms)
**     DSWDTPS_DSWDTPS08    1:8,192 (264.3 ms)
**     DSWDTPS_DSWDTPS09    1:16,384 (528.5 ms)
**     DSWDTPS_DSWDTPS0A    1:32,768 (1.057s)
**     DSWDTPS_DSWDTPS0B    1:65,536 (2.114s)
**     DSWDTPS_DSWDTPS0C    1:131,072 (4.228s)
**     DSWDTPS_DSWDTPS0D    1:262,114 (8.456s)
**     DSWDTPS_DSWDTPS0E    1:524,288 (16.912s)
**     DSWDTPS_DSWDTPS0F    1:1,048,576 (33.825s)
**     DSWDTPS_DSWDTPS10    1:2,097,152 (67.7s)
**     DSWDTPS_DSWDTPS11    1:4,194,304 (135.3s)
**     DSWDTPS_DSWDTPS12    1:8,388,608 (4.5 minutes)
**     DSWDTPS_DSWDTPS13    1:16,777,216 (9.0 minutes)
**     DSWDTPS_DSWDTPS14    1:33,554,432 (18.0 minutes)
**     DSWDTPS_DSWDTPS15    1:67,108,864 (36.1 minutes)
**     DSWDTPS_DSWDTPS16    1:134,217,728 (72.2 minutes)
**     DSWDTPS_DSWDTPS17    1:268,435,456 (2.4 hours)
**     DSWDTPS_DSWDTPS18    1:536,870,912 (4.8 hours)
**     DSWDTPS_DSWDTPS19    1:1,073,741,824 (9.6 hours)
**     DSWDTPS_DSWDTPS1A    1:2,147,483,648 (19.2 hours)
**     DSWDTPS_DSWDTPS1B    1:4,294,967,296 (38.5 hours)
**     DSWDTPS_DSWDTPS1C    1:8,589,934592 (77.0 hours)
**     DSWDTPS_DSWDTPS1D    1:17,179,869,184 (6.4 days)
**     DSWDTPS_DSWDTPS1E    1:34,359,738,368(12.8 days)
**     DSWDTPS_DSWDTPS1F    1:68,719,476,736 (25.7 days)
**
**   DSWDT Reference Clock Select bit:
**     DSWDTOSC_SOSC        DSWDT uses Secondary Oscillator (SOSC)
**     DSWDTOSC_LPRC        DSWDT uses Low Power RC Oscillator (LPRC)
**
**   Deep Sleep Zero-Power BOR Enable bit:
**     DSBOREN_OFF          Deep Sleep BOR disabled in Deep Sleep
**     DSBOREN_ON           Deep Sleep BOR enabled in Deep Sleep
**
**   Deep Sleep Watchdog Timer Enable bit:
**     DSWDTEN_OFF          DSWDT disabled
**     DSWDTEN_ON           DSWDT enabled
**
**   Deep Sleep Software Control Select Bit:
**     DSSWEN_OFF           Deep Sleep disabled
**     DSSWEN_ON            Deep Sleep enabled and controlled by the DSEN bit
**
*/

#define DSWDTPS_DSWDTPS00    0x80E0
#define DSWDTPS_DSWDTPS01    0x80E1
#define DSWDTPS_DSWDTPS02    0x80E2
#define DSWDTPS_DSWDTPS03    0x80E3
#define DSWDTPS_DSWDTPS04    0x80E4
#define DSWDTPS_DSWDTPS05    0x80E5
#define DSWDTPS_DSWDTPS06    0x80E6
#define DSWDTPS_DSWDTPS07    0x80E7
#define DSWDTPS_DSWDTPS08    0x80E8
#define DSWDTPS_DSWDTPS09    0x80E9
#define DSWDTPS_DSWDTPS0A    0x80EA
#define DSWDTPS_DSWDTPS0B    0x80EB
#define DSWDTPS_DSWDTPS0C    0x80EC
#define DSWDTPS_DSWDTPS0D    0x80ED
#define DSWDTPS_DSWDTPS0E    0x80EE
#define DSWDTPS_DSWDTPS0F    0x80EF
#define DSWDTPS_DSWDTPS10    0x80F0
#define DSWDTPS_DSWDTPS11    0x80F1
#define DSWDTPS_DSWDTPS12    0x80F2
#define DSWDTPS_DSWDTPS13    0x80F3
#define DSWDTPS_DSWDTPS14    0x80F4
#define DSWDTPS_DSWDTPS15    0x80F5
#define DSWDTPS_DSWDTPS16    0x80F6
#define DSWDTPS_DSWDTPS17    0x80F7
#define DSWDTPS_DSWDTPS18    0x80F8
#define DSWDTPS_DSWDTPS19    0x80F9
#define DSWDTPS_DSWDTPS1A    0x80FA
#define DSWDTPS_DSWDTPS1B    0x80FB
#define DSWDTPS_DSWDTPS1C    0x80FC
#define DSWDTPS_DSWDTPS1D    0x80FD
#define DSWDTPS_DSWDTPS1E    0x80FE
#define DSWDTPS_DSWDTPS1F    0x80FF

#define DSWDTOSC_SOSC        0x80DF
#define DSWDTOSC_LPRC        0x80FF

#define DSBOREN_OFF          0x80BF
#define DSBOREN_ON           0x80FF

#define DSWDTEN_OFF          0x807F
#define DSWDTEN_ON           0x80FF

