MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA410/mcu.h
/*
** Only one invocation of FWDT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FWDT.
** Multiple options may be combined, as shown:
**
** _FWDT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Watchdog Timer Postscaler:
**     WDTPS_PS1            1:1
**     WDTPS_PS2            1:2
**     WDTPS_PS4            1:4
**     WDTPS_PS8            1:8
**     WDTPS_PS16           1:16
**     WDTPS_PS32           1:32
**     WDTPS_PS64           1:64
**     WDTPS_PS128          1:128
**     WDTPS_PS256          1:256
**     WDTPS_PS512          1:512
**     WDTPS_PS1024         1:1,024
**     WDTPS_PS2048         1:2,048
**     WDTPS_PS4096         1:4,096
**     WDTPS_PS8192         1:8,192
**     WDTPS_PS16384        1:16,384
**     WDTPS_PS32768        1:32,768
**
**   WDT Prescaler:
**     FWPSA_PR32           Prescaler ratio of 1:32
**     FWPSA_PR128          Prescaler ratio of 1:128
**
**   Watchdog Timer Enable:
**     FWDTEN_OFF           Watchdog Timer is disabled
**     FWDTEN_NOSLP         WDT enabled only while device active and disabled in Sleep
**     FWDTEN_SWON          WDT controlled with the SWDTEN bit
**     FWDTEN_ON            Watchdog Timer is enabled
**
**   Windowed Watchdog Timer Disable bit:
**     WINDIS_ON            Windowed WDT enabled
**     WINDIS_OFF           Standard Watchdog Timer enabled (Windowed-mode is disabled)
**
**   Watchdog Window Select bits:
**     WDTWIN_PS75_0        Watch Dog Timer Window Width is 75 percent
**     WDTWIN_PS50_0        Watch Dog Timer Window Width is 50 percent
**     WDTWIN_PS37_5        Watch Dog Timer Window Width is 37.5 percent
**     WDTWIN_PS25_0        Watch Dog Timer Window Width is 25 percent
**
**   WDT Clock Source Select bits:
**     WDTCMX_LPRC          WDT always uses LPRC as its clock source
**     WDTCMX_WDTCLK        WDT clock source is determined by the WDTCLK Configuration bits
**
**   WDT Clock Source Select bits:
**     WDTCLK_SYSCLK        WDT uses system clock when active, LPRC while in Sleep mode
**     WDTCLK_SOSC          WDT uses SOSC input
**     WDTCLK_FRC           WDT uses 31 kHz source from FRC when active in Windowed WDT
**     WDTCLK_LPRC          WDT uses LPRC
**
*/

#define WDTPS_PS1            0x6BF0
#define WDTPS_PS2            0x6BF1
#define WDTPS_PS4            0x6BF2
#define WDTPS_PS8            0x6BF3
#define WDTPS_PS16           0x6BF4
#define WDTPS_PS32           0x6BF5
#define WDTPS_PS64           0x6BF6
#define WDTPS_PS128          0x6BF7
#define WDTPS_PS256          0x6BF8
#define WDTPS_PS512          0x6BF9
#define WDTPS_PS1024         0x6BFA
#define WDTPS_PS2048         0x6BFB
#define WDTPS_PS4096         0x6BFC
#define WDTPS_PS8192         0x6BFD
#define WDTPS_PS16384        0x6BFE
#define WDTPS_PS32768        0x6BFF

#define FWPSA_PR32           0x6BEF
#define FWPSA_PR128          0x6BFF

#define FWDTEN_OFF           0x6B9F
#define FWDTEN_NOSLP         0x6BBF
#define FWDTEN_SWON          0x6BDF
#define FWDTEN_ON            0x6BFF

#define WINDIS_ON            0x6B7F
#define WINDIS_OFF           0x6BFF

#define WDTWIN_PS75_0        0x68FF
#define WDTWIN_PS50_0        0x69FF
#define WDTWIN_PS37_5        0x6AFF
#define WDTWIN_PS25_0        0x6BFF

#define WDTCMX_LPRC          0x63FF
#define WDTCMX_WDTCLK        0x6BFF

#define WDTCLK_SYSCLK        0x0BFF
#define WDTCLK_SOSC          0x2BFF
#define WDTCLK_FRC           0x4BFF
#define WDTCLK_LPRC          0x6BFF

/* Register FPOR (0x57a4)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FPOR;
#define _FPOR(x) __attribute__((address(0x57a4),deprecated_definition("consider migrating to #pragma config"),section("__FPOR.sec"),space(prog))) __prog__ uint16_t _FPOR = (x);

/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Brown-out Reset Enable bits:
**     BOREN_OFF            Brown-out Reset Disabled
**     BOREN_ON             Brown-out Reset Enable
**
**   Low power regulator control:
**     LPCFG_ON             Enabled
**     LPCFG_OFF            Disabled
**
*/

#define BOREN_OFF            0x0004
#define BOREN_ON             0x0005

#define LPCFG_ON             0x0001
#define LPCFG_OFF            0x0005

/* Register FICD (0x57a8)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0x57a8),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Emulator Pin Placement Select bits:
**     ICS_PGx3             Emulator functions are shared with PGEC3/PGED3
**     ICS_PGx2             Emulator functions are shared with PGEC2/PGED2
**     ICS_PGx1             Emulator functions are shared with PGEC1/PGED1
**
**   JTAG Port Enable:
**     JTAGEN_OFF           JTAG port is disabled
**     JTAGEN_ON            JTAG port is enabled
**
**   BOOTSWP Instruction Enable bit:
**     BTSWP_ON             BOOTSWP instruction is enabled
**     BTSWP_OFF            BOOTSWP instruction is disabled
**
*/

#define ICS_PGx3             0x80A1
#define ICS_PGx2             0x80A2
#define ICS_PGx1             0x80A3

#define JTAGEN_OFF           0x8083
#define JTAGEN_ON            0x80A3

#define BTSWP_ON             0x00A3
#define BTSWP_OFF            0x80A3

/* Register FDS (0x57ac)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDS;
#define _FDS(x) __attribute__((address(0x57ac),deprecated_definition("consider migrating to #pragma config"),section("__FDS.sec"),space(prog))) __prog__ uint16_t _FDS = (x);

